
//Проверить, что размер коллекции больше 5 элементов.  size
//Проверить, что коллекция пустая   isEmpty
//Проверить, что коллекция не пустая   isNotEmpty
//Взять элемент по индексу или создать значение если индекса не существует  getOrElse
//Собрать коллекцию в строку   joinToString
//Посчитать сумму всех значений    sum
//Посчитать среднее    average
//Взять максимальное число    maxOrNull
//Взять минимальное число    minOrNull
//Взять первое число или null    firstOrNull
//Проверить что коллекция содержит элемент     contains






//Отфильтровать коллекцию по диапазону 18-30
//Выбрать числа, которые не делятся на 2 и 3 одновременно   filter
//Очистить текстовую коллекцию от null элементов    filterNotNull
//Преобразовать текстовую коллекцию в коллекцию длин слов   associate
//Преобразовать текстовую коллекцию в мапу, где ключи - слова, а значения - перевёрнутые слова   map
//Отсортировать список в алфавитном порядке   sortedDescending
//Отсортировать список по убыванию   takeLast
//Распечатать квадраты элементов списка   forEach
//Группировать список по первой букве слов    groupBy
//Очистить список от дублей   distinct
//Взять первые 3 элемента списка   take
//Взять последние 3 элемента списка  take

